class HydroObservation < ApplicationRecord
  belongs_to :hydro_post
  ICE_PHENOMENA = { 11 => 'Сало',
                    12 => 'Снежура',
                    13 => 'Забереги',
                    15 => 'Забереги',
                    16 => 'Ледоход',
                    18 => 'Ледоход',
                    19 => 'Шугоход',
                    20 => 'Внутриводный лед',
                    21 => 'Внутриводный лед',
                    22 => 'Навалы льда',
                    23 => 'Навалы льда',
                    24 => 'Неполный ледостав',
                    25 => 'Неполный ледостав',
                    26 => 'Неполный ледостав',
                    30 => 'Затор (зажор) выше поста',
                    31 => 'Затор (зажор) ниже поста',
                    34 => 'Затор (зажор) выше поста',
                    35 => 'Затор (зажор) ниже поста',
                    37 => 'Ледостав',
                    38 => 'Вода течет поверх льда',
                    39 => 'Закраины',
                    40 => 'Ледостав',
                    41 => 'Ледостав',
                    42 => 'Ледостав',
                    43 => 'Подвижка льда',
                    44 => 'Разводья',
                    45 => 'Ледостав',
                    46 => 'Забереги',
                    47 => 'Ледостав',
                    52 => 'Навалы льда',
                    63 => 'Ледостав неполный',
                    64 => 'Неполный ледостав',
                    65 => 'Ледостав',
                    66 => 'Ледостав',
                    68 => 'Ледостав',
                    69 => 'Подо льдом шуга',
                    70 => 'Ледостав',
                    71 => 'Наледь',
                    72 => 'Лед нависший',
                    73 => 'Лед ярусный',
                    74 => 'Лед на дне',
                    75 => 'Река промерзла',
                    77 => 'Наледная вода'
                  }
  LONGTERM_LEVEL_AVG = [ [],
    [nil,133,134,137,134,132,136,133,128,129,130,130,131], # 83028 Donetsk                
    [nil, 61, 63, 64, 62, 69, 68, 57, 51, 53, 57, 61, 61], # 83035 Razdolnoe
    [nil,351,356,349,339,333,338,327,314,312,320,329,341], # 83036 Сартана
    [nil,262,270,275,275,265,256,247,241,241,246,252,255], # 83040 Николаевка
	  [nil,409,416,413,407,405,410,396,390,389,394,399,404], # 83045 Кременевка Кальчик
    [nil,160,162,163,157,168,167,156,152,152,153,155,155], # 83048 Мариуполь
    [nil,199,204,203,196,192,189,184,180,185,189,195,200], # 83050 Кременевка Малый Кальчик
    [nil,120,125,132,129,122,118,113,109,109,113,114,117], # 83056 Strukovo
    [nil,389,417,443,434,398,373,352,336,337,346,354,366], # 83060 Dmitrovka
    [nil,239,242,250,246,238,235,232,230,231,233,235,236], # 83068 Novoselovka
    [nil,138,149,141,130,120,113,105, 97,100,110,116,124], # 83074 Blagodatnoe
    [nil,134,137,143,141,137,135,130,125,125,126,127,129], # 83083 Alexeevo-Orlovka
    [nil,263,268,275,269,260,254,243,237,243,252,258,258]  # 83026 Zaharovka
  ]
  FLOOD_ONSET_LEVEL=[204,500,500,500,540,400,400,400,830,350,450,420,601]
  RIVERS=['Кальмиус','Кальмиус','Кальмиус','Мокрая Волноваха','Кальчик','Кальчик','Малый Кальчик','Миус','Миус','Крынка','Крынка','Ольховая','Берда']
  TOWNS=['г. Донецк','с. Раздольное','пгт. Сартана','с. Николаевка','с. Кременевка','г. Мариуполь','с. Кременевка','с. Стрюково','с. Дмитровка','с. Новоселовка','с. Благодатное','пгт. Алексеево-Орловка','с. Захаровка']
  def self.short_last_50_telegrams(user)
    all_fields = HydroObservation.all.limit(50).order(:date_observation, :updated_at).reverse_order
    hydro_posts = HydroPost.all.order(:id)
    all_fields.map do |rec|
      {id: rec.id, date: rec.date_observation, station_name: hydro_posts[rec.hydro_post_id-1].town, telegram: rec.telegram}
    end
  end
  def water_level(value)
    if value>5000
      return -(value-5000)
    else
      return value
    end
  end
  def change_level(value, direct)
    if direct == '0'
      return 'Уровень не изменился'
    else
      return direct == '1' ? "Рост уровня +#{value}" : "Спад уровня -#{value}"
    end
  end
  def self.water_level(obs_date)
    rows = self.select(:hydro_post_id, :telegram).where("hydro_type IN ('ЩЭРЕИ','ЩЭРЕХ','ЩЭРЕА') AND date_observation='#{obs_date}' AND hour_obs=8").order(:hydro_post_id)
    ret = []
    rows.each {|wl|
      ret[wl.hydro_post_id] = wl.telegram[19,4].to_i
    }
    ret
  end
end
